### Loading the SQL database into Pandas, make a histogram and bar chart to compare the average salaries of employees sorted by job title.

#### Call relevant libraries and functions

In [9]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from config import user, password

#### Create the SQL engine and read the relevant tables into pandas

In [13]:
eng = create_engine(f'postgresql://{user}:{password}@localhost:5432/EmployeeSQL')
cxn = eng.connect()

salaries = pd.read_sql('SELECT * FROM Salaries JOIN ', cxn)
salaries.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12